In [22]:
import numpy as np
import pandas as pd
from IPython.display import display
from pandas.io import sql
import pymysql

ImportError: No module named 'pymysql'

In [23]:
import visuals as vs

# Pretty display for notebooks
%matplotlib inline

# Load the wholesale customers dataset
try:
    data = pd.read_csv("malaria_dataset.csv")
except:
    print("Dataset could not be loaded. Is the dataset missing?")

In [24]:
pip install pymysql

SyntaxError: invalid syntax (<ipython-input-24-6fe703d54c0f>, line 1)

In [6]:
display(data.describe())

/Users/akash.sharma/anaconda/lib/python3.5/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

,Years,Afghanistan,Algeria,Angola,Argentina,Armenia,Azerbaijan,Bangladesh,Belize,Benin,...,Turkey,Turkmenistan,Uganda,Uzbekistan,Vanuatu,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
count,17.000000,12.000000,12.000000,16.000000,17.000000,17.000000,17.000000,17.000000,16.000000,17.000000,...,17.000000,17.000000,13.000000,17.000000,17.000000,17.000000,17.000000,16.000000,16.000000,17.000000
mean,1998.000000,1622.750000,0.937083,9876.875000,1.789941,7.521000,28.567588,124.911765,1803.687500,8460.000000,...,42.446471,0.424359,25149.230769,0.240794,9511.176471,121.811765,168.594118,2726.000000,34543.750000,9944.117647
std,5.049752,739.895217,0.610875,5167.308414,1.649510,11.069511,47.860162,85.942618,1561.413493,2763.177519,...,43.427990,0.743412,17258.809568,0.118236,6596.267773,51.450983,72.155444,4331.751343,4456.900081,4213.404293
min,1990.000000,512.000000,0.309000,1270.000000,0.300000,0.000000,0.304000,43.300000,294.000000,1790.000000,...,1.040000,0.000000,6740.000000,0.057100,2250.000000,59.300000,87.000000,92.500000,23800.000000,2800.000000
25%,1994.000000,NaN,NaN,NaN,0.577000,0.000000,1.700000,52.100000,NaN,9110.000000,...,14.600000,0.075100,NaN,0.137000,3400.000000,83.700000,106.000000,NaN,NaN,6320.000000
50%,1998.000000,NaN,NaN,NaN,1.190000,1.710000,6.150000,104.000000,NaN,9620.000000,...,20.900000,0.220000,NaN,0.252000,8410.000000,116.000000,153.000000,NaN,NaN,11400.000000
75%,2002.000000,NaN,NaN,NaN,2.430000,10.900000,28.600000,143.000000,NaN,10100.000000,...,55.800000,0.328000,NaN,0.307000,15000.000000,136.000000,221.000000,NaN,NaN,13900.000000
max,2006.000000,2820.000000,2.330000,21400.000000,5.810000,37.100000,167.000000,333.000000,4780.000000,10400.000000,...,137.000000,3.120000,55300.000000,0.510000,21000.000000,238.000000,327.000000,15800.000000,40500.000000,15200.000000

In [15]:
new_data =  (data.set_index('Years').T)

Years          1990          1991          1992          1993          1994  \
count     89.000000     88.000000     88.000000     90.000000     93.000000
mean    4191.325971   3812.702605   3963.081925   4376.498794   4548.308578
std     8940.506586   7826.364075   8269.889009   9287.877779   9263.844666
min        0.000000      0.000000      0.000000      0.000000      0.019500
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max    42000.000000  43800.000000  46200.000000  47500.000000  47600.000000

Years          1995          1996          1997          1998          1999  \
count     94.000000     97.000000     94.000000     98.000000     96.000000
mean    4096.274311   4574.364644   4214.900500   4847.492023   4513.660265
std     7488.885402   9109.287029   7374.185512  11684.696613   7659.584287
min        0.019900      0.040500      0.017500      0.020300      0.093400
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max    40600.000000  59900.000000  36000.000000  94600.000000  37200.000000

Years          2000          2001          2002          2003          2004  \
count     89.000000    100.000000     94.000000     94.000000     95.000000
mean    4456.576174   5225.910292   5312.652420   6248.058979   5967.239735
std     8733.837844   9429.652380   9030.694733   9861.989801   9942.539406
min        0.025500      0.016200      0.014500      0.064000      0.060100
25%             NaN           NaN           NaN           NaN           NaN
50%             NaN           NaN           NaN           NaN           NaN
75%             NaN           NaN           NaN           NaN           NaN
max    45900.000000  49200.000000  37600.000000  40500.000000  42800.000000

Years          2005          2006
count     98.000000    100.000000
mean    5651.499901   5608.818443
std     9768.672115   9332.669067
min        0.020700      0.000000
25%             NaN           NaN
50%             NaN           NaN
75%             NaN           NaN
max    55300.000000  42800.000000

/Users/akash.sharma/anaconda/lib/python3.5/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

In [20]:
con = MySQLdb.connect()

new_data.to_sql(con=con, name='table_name_for_df', if_exists='replace', flavor='mysql')

NameError: name 'MySQLdb' is not defined

In [18]:
sql.write_frame(df, con=con, name='newTable', 
                if_exists='replace', flavor='mysql')

NameError: name 'MySQLdb' is not defined